; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-27)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 27
2. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 21 of 27
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 27
4. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 22 of 27
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 27
6. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 22 of 27
7. (pick ball22 room4 left)
   deleted: (at ball22 room4) (free left)
   added: (carry ball22 left)
   goals met: 22 of 27
8. (pick ball21 room4 right)
   deleted: (at ball21 room4) (free right)
   added: (carry ball21 right)
   goals met: 22 of 27
9. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 22 of 27
10. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 22 of 27
11. (drop ball21 room3 right)
   deleted: (carry ball21 right)
   added: (at ball21 room3) (free right)
   goals met: 23 of 27
12. (drop ball22 room3 left)
   deleted: (carry ball22 left)
   added: (at ball22 room3) (free left)
   goals met: 24 of 27
13. (pick ball18 room3 left)
   deleted: (at ball18 room3) (free left)
   added: (carry ball18 left)
   goals met: 24 of 27
14. (pick ball17 room3 right)
   deleted: (at ball17 room3) (free right)
   added: (carry ball17 right)
   goals met: 24 of 27
15. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 24 of 27
16. (drop ball17 roomb right)
   deleted: (carry ball17 right)
   added: (at ball17 roomb) (free right)
   goals met: 25 of 27
17. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 26 of 27
18. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 26 of 27
19. (pick ball16 room3 left)
   deleted: (at ball16 room3) (free left)
   added: (carry ball16 left)
   goals met: 26 of 27
20. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 26 of 27
21. (drop ball16 roomb left)
   deleted: (carry ball16 left)
   added: (at ball16 roomb) (free left)
   goals met: 27 of 27
